feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
#include "motor_test.h"

#include <Arduino.h>
#include <SimpleFOC.h>

#include "config.h"

extern "C" {
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_spi.h"
}

namespace motor_test {

namespace {

float rpmToRadPerSec(float rpm) {
  return rpm * 0.104719755f;
}

uint16_t readU16Be(const uint8_t* data) {
  return static_cast<uint16_t>((static_cast<uint16_t>(data[0]) << 8) | data[1]);
}

struct DrvRegisters {
  uint16_t status1 = 0;
  uint16_t status2 = 0;
  uint16_t control1 = 0;
  uint16_t control2 = 0;
  bool frame_fault = false;
  bool spi_ok = false;
  bool control_match = false;
};

SPI_HandleTypeDef g_hspi1 = {};
DrvRegisters g_drv = {};
BLDCMotor g_motor(config::kConfiguredPolePairs);
BLDCDriver3PWM g_driver(config::kPwmAPin, config::kPwmBPin, config::kPwmCPin);
HallSensor g_hall_sensor(config::kHallAPin, config::kHallBPin, config::kHallCPin,
                         config::kConfiguredPolePairs);

struct StepPattern {
  uint8_t pwm_a;
  uint8_t pwm_b;
  uint8_t pwm_c;
  const char* label;
};

constexpr StepPattern kForwardSteps[6] = {
    {config::kSixStepPwmDuty, 0, 0, "A+"},
    {config::kSixStepPwmDuty, config::kSixStepPwmDuty, 0, "A+B+"},
    {0, config::kSixStepPwmDuty, 0, "B+"},
    {0, config::kSixStepPwmDuty, config::kSixStepPwmDuty, "B+C+"},
    {0, 0, config::kSixStepPwmDuty, "C+"},
    {config::kSixStepPwmDuty, 0, config::kSixStepPwmDuty, "A+C+"},
};

constexpr uint8_t kHallSequence[6] = {0b001, 0b101, 0b100, 0b110, 0b010, 0b011};
constexpr uint8_t kDrvRegStatus1 = 0x00u;
constexpr uint8_t kDrvRegStatus2 = 0x01u;
constexpr uint8_t kDrvRegControl1 = 0x02u;
constexpr uint8_t kDrvRegControl2 = 0x03u;

enum Drv8301Control1Bits : uint16_t {
  kCtrl1OcAdjMask = 0x001Fu,
  kCtrl1OcpModeShift = 5,
  kCtrl1PwmModeBit = 7,
  kCtrl1GateResetBit = 8,
  kCtrl1GateCurrentShift = 9,
};

enum Drv8301Control2Bits : uint16_t {
  kCtrl2OcToffBit = 0,
  kCtrl2DcCalCh2Bit = 1,
  kCtrl2DcCalCh1Bit = 2,
  kCtrl2GainShift = 3,
  kCtrl2OctwModeShift = 5,
};

bool g_driver_enabled = false;
bool g_drv_configured = false;
bool g_fault_latched = false;
bool g_openloop_started = false;
bool g_openloop_debug_started = false;
bool g_closedloop_started = false;
bool g_closedloop_startup_active = false;
bool g_drv_spi_stage_pwm = false;
bool g_sixstep_startup_active = false;
uint8_t g_step_index = 0;
uint8_t g_last_hall_state = 0xFF;
uint32_t g_boot_ms = 0;
uint32_t g_last_print_ms = 0;
uint32_t g_last_phase_change_ms = 0;
uint32_t g_sixstep_enable_ms = 0;
uint32_t g_sixstep_last_kick_ms = 0;
uint32_t g_closedloop_enable_ms = 0;
uint32_t g_openloop_enable_ms = 0;
uint32_t g_openloop_debug_step_ms = 0;
uint32_t g_openloop_step_interval_ms = 0;
float g_openloop_debug_angle_el = 0.0f;
float g_openloop_debug_voltage = 0.0f;
float g_openloop_target_rad_s = 0.0f;
bool g_openloop_move_called = false;
uint8_t g_sixstep_current_duty = config::kSixStepPwmDuty;
bool g_closedloop_loopfoc_called = false;
bool g_closedloop_move_called = false;
bool g_closedloop_initfoc_started = false;
bool g_closedloop_initfoc_done = false;

void printState(Stream& serial, const char* reason);

void advanceOpenloopAngleStep() {
  g_openloop_debug_angle_el += config::kSimpleFocOpenloopDebugStepDeg * DEG_TO_RAD;
  if (g_openloop_debug_angle_el >= _2PI) {
    g_openloop_debug_angle_el -= _2PI;
  }
}

uint32_t openloopStepIntervalMsForRpm(float rpm) {
  const float clamped_rpm = max(1.0f, rpm);
  const float step_rad = config::kSimpleFocOpenloopDebugStepDeg * DEG_TO_RAD;
  const float electrical_rad_per_sec =
      rpmToRadPerSec(clamped_rpm) * static_cast<float>(config::kConfiguredPolePairs);
  const float interval_ms = (step_rad / electrical_rad_per_sec) * 1000.0f;
  return static_cast<uint32_t>(max(20.0f, min(200.0f, interval_ms)));
}

bool faultActive() {
  return digitalRead(config::kDrvFaultPin) == LOW;
}

void doHallA() {
  g_hall_sensor.handleA();
}

void doHallB() {
  g_hall_sensor.handleB();
}

void doHallC() {
  g_hall_sensor.handleC();
}

uint16_t buildDrvControl1(bool gate_reset) {
  uint16_t value = 0;
  value |= static_cast<uint16_t>(config::kDrvOcpAdjustCode & 0x1Fu);
  value |= static_cast<uint16_t>((config::kDrvOcpModeCode & 0x03u) << kCtrl1OcpModeShift);
  if (config::kDrvUse3PwmMode) {
    value |= static_cast<uint16_t>(1u << kCtrl1PwmModeBit);
  }
  if (gate_reset) {
    value |= static_cast<uint16_t>(1u << kCtrl1GateResetBit);
  }
  value |= static_cast<uint16_t>((config::kDrvGateCurrentCode & 0x03u) << kCtrl1GateCurrentShift);
  return value;
}

uint16_t buildDrvControl2() {
  uint16_t value = 0;
  if (config::kDrvOcToff) {
    value |= static_cast<uint16_t>(1u << kCtrl2OcToffBit);
  }
  if (config::kDrvDcCalCh2) {
    value |= static_cast<uint16_t>(1u << kCtrl2DcCalCh2Bit);
  }
  if (config::kDrvDcCalCh1) {
    value |= static_cast<uint16_t>(1u << kCtrl2DcCalCh1Bit);
  }
  value |= static_cast<uint16_t>((config::kDrvShuntGainCode & 0x03u) << kCtrl2GainShift);
  value |= static_cast<uint16_t>((config::kDrvOctwModeCode & 0x03u) << kCtrl2OctwModeShift);
  return value;
}

uint8_t readHallState() {
  const uint8_t a = static_cast<uint8_t>(digitalRead(config::kHallAPin) == HIGH);
  const uint8_t b = static_cast<uint8_t>(digitalRead(config::kHallBPin) == HIGH);
  const uint8_t c = static_cast<uint8_t>(digitalRead(config::kHallCPin) == HIGH);
  return static_cast<uint8_t>((a << 2) | (b << 1) | c);
}

const StepPattern& activePattern() {
  return kForwardSteps[g_step_index % 6u];
}

void applyPatternRaw(const StepPattern& pattern) {
  analogWrite(config::kPwmAPin, pattern.pwm_a);
  analogWrite(config::kPwmBPin, pattern.pwm_b);
  analogWrite(config::kPwmCPin, pattern.pwm_c);
}

void pwmOff() {
  analogWrite(config::kPwmAPin, 0);
  analogWrite(config::kPwmBPin, 0);
  analogWrite(config::kPwmCPin, 0);
}

void drvDisable() {
  pwmOff();
  digitalWrite(config::kDrvEnablePin, LOW);
  g_driver_enabled = false;
  g_drv_configured = false;
}

bool drvStatus2GvddOv() {
  return (g_drv.status2 & 0x80u) != 0u;
}

uint8_t drvStatus2DeviceId() {
  return static_cast<uint8_t>(g_drv.status2 & 0x0Fu);
}

bool drvReadyForPwm() {
  return g_driver_enabled && g_drv_configured && g_drv.control_match && !g_drv.frame_fault &&
         !faultActive() && g_drv.status1 == 0u && !drvStatus2GvddOv();
}

