feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
bool applyPattern(const StepPattern& pattern) {
  if (!drvReadyForPwm()) {
    pwmOff();
    return false;
  }
  applyPatternRaw(pattern);
  return true;
}

void applyStepIndexWithDuty(uint8_t step_index, uint8_t duty) {
  g_step_index = static_cast<uint8_t>(step_index % 6u);
  const StepPattern& base = activePattern();
  g_sixstep_current_duty = duty;
  if (!drvReadyForPwm()) {
    pwmOff();
    return;
  }
  analogWrite(config::kPwmAPin, base.pwm_a ? duty : 0);
  analogWrite(config::kPwmBPin, base.pwm_b ? duty : 0);
  analogWrite(config::kPwmCPin, base.pwm_c ? duty : 0);
}

void applySinglePhase(uint8_t phase_index) {
  if (!drvReadyForPwm()) {
    pwmOff();
    return;
  }
  analogWrite(config::kPwmAPin, phase_index == 0 ? config::kPhaseCheckPwmDuty : 0);
  analogWrite(config::kPwmBPin, phase_index == 1 ? config::kPhaseCheckPwmDuty : 0);
  analogWrite(config::kPwmCPin, phase_index == 2 ? config::kPhaseCheckPwmDuty : 0);
}

void applySinglePhaseStability(uint8_t phase_index) {
  if (!drvReadyForPwm()) {
    pwmOff();
    return;
  }
  analogWrite(config::kPwmAPin, phase_index == 0 ? config::kDrvSpiStabilityPwmDuty : 0);
  analogWrite(config::kPwmBPin, phase_index == 1 ? config::kDrvSpiStabilityPwmDuty : 0);
  analogWrite(config::kPwmCPin, phase_index == 2 ? config::kDrvSpiStabilityPwmDuty : 0);
}

bool drvSpiGpioInit() {
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_SPI1_CLK_ENABLE();

  GPIO_InitTypeDef gpio = {};
  gpio.Pin = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
  gpio.Mode = GPIO_MODE_AF_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio.Alternate = GPIO_AF5_SPI1;
  HAL_GPIO_Init(GPIOA, &gpio);

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
  gpio.Pin = GPIO_PIN_4;
  gpio.Mode = GPIO_MODE_OUTPUT_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Speed = GPIO_SPEED_FREQ_LOW;
  gpio.Alternate = 0;
  HAL_GPIO_Init(GPIOA, &gpio);
  return true;
}

bool drvSpiInit() {
  if (!drvSpiGpioInit()) {
    return false;
  }

  g_hspi1.Instance = SPI1;
  g_hspi1.Init.Mode = SPI_MODE_MASTER;
  g_hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  g_hspi1.Init.DataSize = SPI_DATASIZE_16BIT;
  g_hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  g_hspi1.Init.CLKPhase = SPI_PHASE_2EDGE;
  g_hspi1.Init.NSS = SPI_NSS_SOFT;
  g_hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
  g_hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  g_hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  g_hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  g_hspi1.Init.CRCPolynomial = 7;
  g_hspi1.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  g_hspi1.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;

  g_drv.spi_ok = (HAL_SPI_Init(&g_hspi1) == HAL_OK);
  return g_drv.spi_ok;
}

HAL_StatusTypeDef drvTransfer16(uint16_t tx_word, uint16_t* rx_word) {
  uint16_t tx_buf = tx_word;
  uint16_t rx_buf = 0;
  delayMicroseconds(2);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
  delayMicroseconds(2);
  const HAL_StatusTypeDef status =
      HAL_SPI_TransmitReceive(&g_hspi1, reinterpret_cast<uint8_t*>(&tx_buf),
                              reinterpret_cast<uint8_t*>(&rx_buf), 1u, 20u);
  delayMicroseconds(2);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
  delayMicroseconds(2);

  if (status == HAL_OK && rx_word != nullptr) {
    *rx_word = rx_buf;
  }
  return status;
}

HAL_StatusTypeDef drvReadRegister(uint8_t reg, uint16_t* value) {
  uint16_t rx_word = 0;
  const uint16_t cmd = static_cast<uint16_t>(0x8000u | ((static_cast<uint16_t>(reg) & 0x0Fu) << 11));
  HAL_StatusTypeDef status = drvTransfer16(cmd, &rx_word);
  if (status != HAL_OK) {
    g_drv.spi_ok = false;
    return status;
  }

  status = drvTransfer16(0u, &rx_word);
  if (status != HAL_OK) {
    g_drv.spi_ok = false;
    return status;
  }

  g_drv.frame_fault = ((rx_word & 0x8000u) != 0u);

  if (value != nullptr) {
    *value = static_cast<uint16_t>(rx_word & 0x07FFu);
  }
  g_drv.spi_ok = true;
  return HAL_OK;
}

HAL_StatusTypeDef drvWriteRegister(uint8_t reg, uint16_t value) {
  uint16_t rx_word = 0;
  const uint16_t cmd =
      static_cast<uint16_t>(((static_cast<uint16_t>(reg) & 0x0Fu) << 11) | (value & 0x07FFu));
  const HAL_StatusTypeDef status = drvTransfer16(cmd, &rx_word);
  g_drv.spi_ok = (status == HAL_OK);
  return status;
}

bool drvReadAll() {
  if (!g_driver_enabled) {
    g_drv.spi_ok = false;
    g_drv.frame_fault = false;
    g_drv.control_match = false;
    return false;
  }
  bool ok = true;
  ok = (drvReadRegister(kDrvRegStatus1, &g_drv.status1) == HAL_OK) && ok;
  ok = (drvReadRegister(kDrvRegStatus2, &g_drv.status2) == HAL_OK) && ok;
  ok = (drvReadRegister(kDrvRegControl1, &g_drv.control1) == HAL_OK) && ok;
  ok = (drvReadRegister(kDrvRegControl2, &g_drv.control2) == HAL_OK) && ok;
  const uint16_t expected_ctrl1 = buildDrvControl1(false);
  const uint16_t expected_ctrl2 = buildDrvControl2();
  g_drv.control_match =
      (g_drv.control1 == expected_ctrl1) && (g_drv.control2 == expected_ctrl2);
  g_drv.spi_ok = ok;
  return ok;
}

bool drvConfigure3Pwm() {
  if (!g_driver_enabled) {
    g_drv_configured = false;
    return false;
  }
  const uint16_t expected_ctrl1 = buildDrvControl1(false);
  const uint16_t reset_ctrl1 = buildDrvControl1(true);
  const uint16_t expected_ctrl2 = buildDrvControl2();

  (void)drvWriteRegister(kDrvRegControl1, reset_ctrl1);
  delay(1);

  if (drvWriteRegister(kDrvRegControl1, expected_ctrl1) != HAL_OK) {
    return false;
  }
  if (drvWriteRegister(kDrvRegControl2, expected_ctrl2) != HAL_OK) {
    return false;
  }
  g_drv_configured = drvReadAll();
  return g_drv_configured;
}

bool drvEnableAndConfigure(Stream& serial) {
  pwmOff();
  digitalWrite(config::kDrvEnablePin, HIGH);
  delay(50);
  g_driver_enabled = true;
  g_drv_configured = false;

  if (!drvConfigure3Pwm()) {
    printState(serial, "drv_config_failed");
    pwmOff();
    g_driver_enabled = false;
    g_drv_configured = false;
    return false;
  }

  (void)drvReadAll();
  if (!faultActive() && !g_drv.frame_fault && g_drv.control_match && g_drv.status1 == 0u &&
      !drvStatus2GvddOv()) {
    g_driver_enabled = true;
    g_drv_configured = true;
    return true;
  }

  printState(serial, "drv_config_invalid");
  pwmOff();
  g_driver_enabled = false;
  g_drv_configured = false;
  return false;
}

bool isValidHallState(uint8_t hall) {
  return hall != 0b000 && hall != 0b111;
}

int8_t hallIndex(uint8_t hall) {
  for (uint8_t index = 0; index < 6; ++index) {
    if (kHallSequence[index] == hall) {
      return static_cast<int8_t>(index);
    }
  }
  return -1;
}

void printHallBits(Stream& serial, uint8_t hall) {
  serial.print((hall >> 2) & 0x01);
  serial.print((hall >> 1) & 0x01);
  serial.print(hall & 0x01);
}

uint8_t commutationIndexFromHall(uint8_t hall) {
  const int8_t hall_index = hallIndex(hall);
  if (hall_index < 0) {
    return 0;
  }

  int8_t target_index = static_cast<int8_t>(hall_index + config::kSixStepHallAdvance);
  if (config::kSixStepReverseDirection) {
    target_index = static_cast<int8_t>(hall_index - config::kSixStepHallAdvance);
  }

  while (target_index < 0) {
    target_index += 6;
  }
  while (target_index >= 6) {
    target_index -= 6;
  }
  return static_cast<uint8_t>(target_index);
}

