feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
bool applyCommutationForHall(uint8_t hall) {
  if (!isValidHallState(hall)) {
    pwmOff();
    return false;
  }

  applyStepIndexWithDuty(commutationIndexFromHall(hall), config::kSixStepPwmDuty);
  return true;
}

void printDrvRegisters(Stream& serial) {
  serial.print(" spi_ok=");
  serial.print(g_drv.spi_ok ? "yes" : "no");
  serial.print(" frame_fault=");
  serial.print(g_drv.frame_fault ? "yes" : "no");
  serial.print(" status1=0x");
  serial.print(g_drv.status1, HEX);
  serial.print(" status2_raw=0x");
  serial.print(g_drv.status2, HEX);
  serial.print(" status2_device_id=0x");
  serial.print(drvStatus2DeviceId(), HEX);
  serial.print(" status2_gvdd_ov=");
  serial.print(drvStatus2GvddOv() ? "yes" : "no");
  serial.print(" ctrl1=0x");
  serial.print(g_drv.control1, HEX);
  serial.print(" ctrl2=0x");
  serial.print(g_drv.control2, HEX);
  serial.print(" ctrl_match=");
  serial.print(g_drv.control_match ? "yes" : "no");
}

void printState(Stream& serial, const char* reason) {
  if (config::kTestMode == config::TEST_HALL_SENSOR_CHECK) {
    const uint8_t hall = readHallState();
    g_hall_sensor.update();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" raw_hall=");
    printHallBits(serial, hall);
    serial.print(" raw_valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" hall_idx=");
    serial.print(hallIndex(hall));
    serial.print(" sensor_angle=");
    serial.print(g_hall_sensor.getAngle(), 4);
    serial.print(" sensor_vel=");
    serial.print(g_hall_sensor.getVelocity(), 4);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_DRIVER_SPI_STABILITY) {
    const uint8_t hall = readHallState();
    static const char* kPhaseLabels[3] = {"A", "B", "C"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" stage=");
    serial.print(g_drv_spi_stage_pwm ? "pwm_stress" : "no_pwm");
    serial.print(" phase=");
    serial.print(kPhaseLabels[g_step_index % 3u]);
    serial.print(" pwm=");
    serial.print(g_drv_spi_stage_pwm ? config::kDrvSpiStabilityPwmDuty : 0);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP) {
    const uint8_t hall = readHallState();
    g_hall_sensor.update();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" mode=");
    serial.print(g_closedloop_startup_active ? "startup" : "closed");
    serial.print(" target_rpm=");
    serial.print(config::kSimpleFocClosedloopTargetRpm, 1);
    serial.print(" target_rad_s=");
    serial.print(rpmToRadPerSec(config::kSimpleFocClosedloopTargetRpm), 3);
    serial.print(" closedloop_loopfoc_called=");
    serial.print(g_closedloop_loopfoc_called ? "yes" : "no");
    serial.print(" closedloop_move_called=");
    serial.print(g_closedloop_move_called ? "yes" : "no");
    serial.print(" initFOC_start=");
    serial.print(g_closedloop_initfoc_started ? "yes" : "no");
    serial.print(" initFOC_done=");
    serial.print(g_closedloop_initfoc_done ? "yes" : "no");
    serial.print(" shaft_vel=");
    serial.print(g_hall_sensor.getVelocity(), 3);
    serial.print(" shaft_angle=");
    serial.print(g_hall_sensor.getAngle(), 3);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP_DEBUG) {
    const uint8_t hall = readHallState();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" dbg_voltage=");
    serial.print(g_openloop_debug_voltage, 2);
    serial.print(" angle_el=");
    serial.print(g_openloop_debug_angle_el, 3);
    serial.print(" step_deg=");
    serial.print(config::kSimpleFocOpenloopDebugStepDeg, 1);
    serial.print(" step_ms=");
    serial.print(config::kSimpleFocOpenloopDebugStepMs);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK) {
    const uint8_t hall = readHallState();
    static const char* kPhaseLabels[3] = {"A", "B", "C"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" phase=");
    serial.print(kPhaseLabels[g_step_index % 3u]);
    serial.print(" pwm=");
    serial.print(config::kPhaseCheckPwmDuty);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP) {
    const uint8_t hall = readHallState();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" target_rpm=");
    serial.print(config::kSimpleFocOpenloopTargetRpm, 1);
    serial.print(" target_rad_s=");
    serial.print(g_openloop_target_rad_s, 3);
    serial.print(" openloop_move_called=");
    serial.print(g_openloop_move_called ? "yes" : "no");
    serial.print(" motor.voltage_limit=");
    serial.print(g_motor.voltage_limit, 2);
    serial.print(" driver.voltage_limit=");
    serial.print(g_driver.voltage_limit, 2);
    serial.print(" drv_configured=");
    serial.print(g_drv_configured ? "yes" : "no");
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" hall_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  const StepPattern& pattern = activePattern();
  const uint8_t hall = readHallState();
  serial.print("motor_test reason=");
  serial.print(reason);
  serial.print(" en=");
  serial.print(g_driver_enabled ? "HIGH" : "LOW");
  serial.print(" fault=");
  serial.print(faultActive() ? "ACTIVE" : "inactive");
  serial.print(" step=");
  serial.print(g_step_index % 6u);
  serial.print(" pattern=");
  serial.print(pattern.label);
  serial.print(" mode=");
  serial.print(g_sixstep_startup_active ? "startup_kick" : "hall_track");
  serial.print(" hall_idx=");
  serial.print(hallIndex(hall));
  serial.print(" pwm=[");
  serial.print(pattern.pwm_a ? g_sixstep_current_duty : 0);
  serial.print(",");
  serial.print(pattern.pwm_b ? g_sixstep_current_duty : 0);
  serial.print(",");
  serial.print(pattern.pwm_c ? g_sixstep_current_duty : 0);
  serial.print("] hall=");
  serial.print((hall >> 2) & 0x01);
  serial.print((hall >> 1) & 0x01);
  serial.print(hall & 0x01);
  serial.print(" valid=");
  serial.println(isValidHallState(hall) ? "yes" : "no");
}

