feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  g_last_hall_state = readHallState();
  g_last_print_ms = 0;

  g_hall_sensor.pullup = Pullup::USE_INTERN;
  g_hall_sensor.init();
  g_hall_sensor.enableInterrupts(doHallA, doHallB, doHallC);

  serial.println("HallSensor integration check");
  serial.println("Rotate motor by hand. Compare raw_hall and sensor angle/velocity.");
  printState(serial, "boot");
}

void beginPhaseCheck(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("Phase check test");
  serial.println("One phase at a time with low PWM.");
  serial.print("Enable delay ms=");
  serial.print(config::kPhaseCheckEnableDelayMs);
  serial.print(" hold ms=");
  serial.print(config::kPhaseCheckHoldMs);
  serial.print(" pwm=");
  serial.println(config::kPhaseCheckPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Expect similar rotor holding feel on A, B and C.");
  printState(serial, "boot");
}

void beginDrvSpiStability(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_drv_spi_stage_pwm = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("DRV SPI stability test");
  serial.println("Stage 1: driver enabled, no PWM. Stage 2: low-PWM phase stress.");
  serial.print("Enable delay ms=");
  serial.print(config::kDrvSpiStabilityEnableDelayMs);
  serial.print(" no_pwm_ms=");
  serial.print(config::kDrvSpiStabilityNoPwmMs);
  serial.print(" step_ms=");
  serial.print(config::kDrvSpiStabilityStepMs);
  serial.print(" pwm=");
  serial.println(config::kDrvSpiStabilityPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  printState(serial, "boot");
}

void updatePhaseCheck(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySinglePhase(g_step_index % 3u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhase(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updateDrvSpiStability(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint16_t prev_ctrl1 = g_drv.control1;
  const uint16_t prev_ctrl2 = g_drv.control2;
  const bool prev_match = g_drv.control_match;

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kDrvSpiStabilityEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && !g_drv_spi_stage_pwm &&
      (now - g_last_phase_change_ms) >= config::kDrvSpiStabilityNoPwmMs) {
    g_drv_spi_stage_pwm = true;
    g_step_index = 0;
    applySinglePhaseStability(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "pwm_stress_start");
  }

  if (g_driver_enabled && g_drv_spi_stage_pwm &&
      (now - g_last_phase_change_ms) >= config::kDrvSpiStabilityStepMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhaseStability(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kDrvSpiStabilityStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    if (g_drv.control1 != prev_ctrl1 || g_drv.control2 != prev_ctrl2 || g_drv.control_match != prev_match) {
      printState(serial, "reg_change");
    } else {
      printState(serial, "periodic");
    }
  }
}

void updateSimpleFocOpenloop(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver.disable();
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_openloop_started = false;
      g_openloop_enable_ms = 0;
      g_openloop_target_rad_s = 0.0f;
      g_openloop_move_called = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    g_openloop_move_called = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver.enable();
      g_motor.enable();
      g_openloop_started = true;
      g_openloop_enable_ms = now;
      g_last_hall_state = hall;
    } else {
      g_openloop_started = false;
    }
    printState(serial, g_openloop_started ? "enable_applied" : "enable_failed");
  }

  g_openloop_target_rad_s = rpmToRadPerSec(config::kSimpleFocOpenloopTargetRpm);
  g_openloop_move_called = false;

