feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  if (drvReadyForPwm() && g_openloop_started) {
    g_motor.voltage_limit = config::kSimpleFocOpenloopVoltageLimit;
    g_motor.move(g_openloop_target_rad_s);
    g_openloop_move_called = true;
  } else {
    pwmOff();
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    g_last_print_ms = now;
    if (g_driver_enabled) {
      (void)drvReadAll();
    }
    printState(serial, "periodic");
  }

  if (config::kSimpleFocLogHallChanges && g_driver_enabled && hall != g_last_hall_state) {
    serial.print("motor_test reason=hall_change prev=");
    printHallBits(serial, g_last_hall_state);
    serial.print(" next=");
    printHallBits(serial, hall);
    serial.print(" prev_idx=");
    serial.print(hallIndex(g_last_hall_state));
    serial.print(" next_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" target_rad_s=");
    serial.print(g_openloop_target_rad_s, 3);
    serial.print(" openloop_move_called=");
    serial.print(g_openloop_move_called ? "yes" : "no");
    serial.print(" drv_configured=");
    serial.print(g_drv_configured ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    g_last_hall_state = hall;
  }
}

void updateSimpleFocOpenloopDebug(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver.disable();
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_openloop_debug_started = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver.enable();
      g_motor.enable();
      g_openloop_debug_started = true;
      g_openloop_debug_step_ms = now;
      g_openloop_debug_angle_el = 0.0f;
      g_openloop_debug_voltage = config::kSimpleFocOpenloopDebugVoltage;
      g_last_hall_state = hall;
      if (drvReadyForPwm()) {
        g_motor.setPhaseVoltage(g_openloop_debug_voltage, 0.0f, g_openloop_debug_angle_el);
      }
    }
    printState(serial, g_openloop_debug_started ? "enable_applied" : "enable_failed");
  }

  if (g_openloop_debug_started && (now - g_openloop_debug_step_ms) >= config::kSimpleFocOpenloopDebugStepMs) {
    g_openloop_debug_step_ms = now;
    advanceOpenloopAngleStep();
    if (drvReadyForPwm()) {
      g_motor.setPhaseVoltage(g_openloop_debug_voltage, 0.0f, g_openloop_debug_angle_el);
    } else {
      pwmOff();
    }
    printState(serial, "angle_step");
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    g_last_print_ms = now;
    if (g_driver_enabled) {
      (void)drvReadAll();
    }
    printState(serial, "periodic");
  }

  if (config::kSimpleFocLogHallChanges && g_driver_enabled && hall != g_last_hall_state) {
    serial.print("motor_test reason=hall_change prev=");
    printHallBits(serial, g_last_hall_state);
    serial.print(" next=");
    printHallBits(serial, hall);
    serial.print(" prev_idx=");
    serial.print(hallIndex(g_last_hall_state));
    serial.print(" next_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" angle_el=");
    serial.print(g_openloop_debug_angle_el, 3);
    printDrvRegisters(serial);
    serial.println();
    g_last_hall_state = hall;
  }
}

void updateSimpleFocClosedloop(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();
  g_closedloop_loopfoc_called = false;
  g_closedloop_move_called = false;

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver.disable();
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_closedloop_started = false;
      g_closedloop_initfoc_done = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver.enable();
      g_motor.enable();
      g_closedloop_enable_ms = now;
      g_last_hall_state = hall;
      g_closedloop_initfoc_started = true;
      printState(serial, "initFOC_start");
      g_motor.initFOC();
      g_closedloop_initfoc_done = true;
      printState(serial, "initFOC_done");
      if (drvReadyForPwm()) {
        g_closedloop_started = true;
        g_closedloop_startup_active = config::kSimpleFocClosedloopUseStartupAssist;
        g_motor.controller = g_closedloop_startup_active ? MotionControlType::velocity_openloop
                                                         : MotionControlType::velocity;
      } else {
        pwmOff();
        g_closedloop_started = false;
      }
    }
    printState(serial, g_closedloop_started ? "enable_applied" : "enable_failed");
  }

  if (g_closedloop_started && drvReadyForPwm()) {
    const float target_sign = config::kSimpleFocClosedloopReverse ? -1.0f : 1.0f;
    if (g_closedloop_startup_active) {
      const uint32_t elapsed_ms = now - g_closedloop_enable_ms;
      if (elapsed_ms >= config::kSimpleFocClosedloopStartupMs) {
        g_closedloop_startup_active = false;
        g_motor.controller = MotionControlType::velocity;
        printState(serial, "startup_handoff");
      } else {
        g_motor.move(rpmToRadPerSec(config::kSimpleFocClosedloopStartupRpm) * target_sign);
        g_closedloop_move_called = true;
      }
    }

    if (!g_closedloop_startup_active) {
      g_motor.loopFOC();
      g_closedloop_loopfoc_called = true;
      g_motor.move(rpmToRadPerSec(config::kSimpleFocClosedloopTargetRpm) * target_sign);
      g_closedloop_move_called = true;
    }
  } else {
    pwmOff();
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    g_last_print_ms = now;
    if (g_driver_enabled) {
      (void)drvReadAll();
    }
    printState(serial, "periodic");
  }

  if (config::kSimpleFocLogHallChanges && g_driver_enabled && hall != g_last_hall_state) {
    serial.print("motor_test reason=hall_change prev=");
    printHallBits(serial, g_last_hall_state);
    serial.print(" next=");
    printHallBits(serial, hall);
    serial.print(" prev_idx=");
    serial.print(hallIndex(g_last_hall_state));
    serial.print(" next_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" target_rpm=");
    serial.print(config::kSimpleFocClosedloopTargetRpm, 1);
    printDrvRegisters(serial);
    serial.println();
    g_last_hall_state = hall;
  }
}

void updateHallSensorCheck(Stream& serial) {
  const uint32_t now = millis();
  const uint8_t hall = readHallState();
  g_hall_sensor.update();

  if (hall != g_last_hall_state) {
    g_last_hall_state = hall;
    printState(serial, "hall_change");
  }

